package objects

// Rocket описывает состояние ракеты
type Rocket struct {
	X, Y    int     // Позиция (левый верхний угол спрайта)
	Vx, Vy  float64 // Скорости по осям X и Y
	ThrustX float64 // Тяга по горизонтали (направление вправо положительное)
	ThrustY float64 // Тяга по вертикали (для подъёма, базовая равна 9.8 для зависания)
	Fuel    float64 // Оставшееся топливо
}

var RocketSprite = []string{
	"  /\\  ",
	" |==| ",
	" |  | ",
	"  ||  ",
}

var ExplosionSprite = []string{
	"   ***   ",
	"  *****  ",
	" ******* ",
	"*********",
	" ******* ",
	"  *****  ",
	"   ***   ",
}
